In [3]:
import pandas as pd
import mysql.connector

In [4]:
# připojit k databázi - db object pro referenci na připojení
db = mysql.connector.connect(
  host="localhost", # server - u nás na PC localhost, jinak např. https://svatky.adresa.info/
  user="root", # přihlášení
  password="root",
  database="nase_db" # výběr schématu/db -> odpovídá sql: use nase_db;
)
# cursor -> object, přes který provádím sql příkazy pomocí execute
cursor = db.cursor()

In [37]:
# uživatel si zadá data
mesto = input("Zadej mesto: ")
populace = input("Zadej populace: ")
zaplavy = input("Zadej zaplavy: ")

In [43]:
# query na zapsání dat -> odladit ve workbenchy
sql = f"INSERT INTO mesta (nazev, populace, zaplavy) VALUES ('{mesto}', {populace}, {zaplavy});"
# zkus zapsat
try:
  cursor.execute(sql)
  db.commit()
  print("Úspěch")
except:
  print("Error")

Úspěch

In [44]:
# přečti data z tabulky města
sql = f"SELECT * from mesta;"
cursor.execute(sql)
vysledek = cursor.fetchall()

In [45]:
# přečti nastavení tabulky -> názvy sloupců, datové typy apod.
sql = "DESCRIBE mesta;"
cursor.execute(sql)
informace_sloupce = cursor.fetchall()
# extrakce pomocí list comprehension názvu sloupce z metadat
nazvy_sloupce = [col[0] for col in informace_sloupce]

In [46]:
# zpracuj výsledky -> názvy sloupců z sql describe a data z sql select
tabulka = pd.DataFrame.from_records(vysledek, columns=nazvy_sloupce, index="id")
tabulka

         nazev  populace  zaplavy
id
1        Krnov     24000        1
2        Opava     80000        1
4      Havířov     90000        1
5         Test     10000        0
6         Test     10000        0
7   Prachatice     20000        0
8    Karlovice      3000        1
9    Karlovice      3000        1

In [7]:
sql = """select clients.first_name, clients.last_name, 
avg(bookings.total_amount) as 'Average_reservations_price', 
count(bookings.car_id) as 'Number_of_rented_cars'
from bookings
left join clients on
bookings.client_id=clients.client_id
group by bookings.client_id
having Number_of_rented_cars > 1
order by Number_of_rented_cars desc;
"""

In [9]:
# připojit k databázi - db object pro referenci na připojení
db = mysql.connector.connect(
  host="localhost", # server - u nás na PC localhost, jinak např. https://svatky.adresa.info/
  user="root", # přihlášení
  password="root",
  database="car_rental" # výběr schématu/db -> odpovídá sql: use nase_db;
)
# cursor -> object, přes který provádím sql příkazy pomocí execute
cursor = db.cursor()

In [11]:
pd.read_sql(sql, db)

C:\Users\cejs0\AppData\Local\Temp\ipykernel_3940\2738496064.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(sql, db)

  first_name last_name  Average_reservations_price  Number_of_rented_cars
0       Anna      Inna                       448.0                      5
1     Damian      Papa                       780.0                      4
2      Marek    Troska                      1400.0                      2